{
  "corpus": "A love dart (also known as a gypsobelum, shooting darts, or just as darts) is a sharp, calcareous or chitinous dart which some hermaphroditic land snails and slugs create. Love darts are both formed and stored internally in a dart sac. These darts are made in sexually mature animals only, and are used as part of the sequence of events during courtship, before actual mating takes place. Darts are quite large compared to the size of the animal: in the case of the semi-slug genus Parmarion, the length of a dart can be up to one fifth that of the semi-slug's foot.\nThe process of using love darts in snails is a form of sexual selection. Prior to copulation, each of the two snails (or slugs) attempts to \"shoot\" one (or more) darts into the other snail (or slug). There is no organ to receive the dart; this action is more analogous to stabbing, or to being shot with an arrow or flechette. The dart does not fly through the air to reach its target, but is \"fired\" as a contact shot.\nThe love dart is not a penial stylet (in other words, it is not an accessory organ for sperm transfer). The exchange of sperm between both of the two land snails is a completely separate part of the mating progression. Nevertheless, recent research shows that use of the dart can strongly favor the reproductive outcome for the snail that is able to lodge a dart in its partner. This is because mucus on the dart contains an allomone (pheromone-like) compound that promotes sperm preservation mechanisms in the female.\nLove darts are shaped in many distinctive ways, which vary considerably between species. What all the shapes of love darts have in common is their harpoon-like or needle-like ability to pierce.\nCupid carries two kinds of arrows, or darts, one with a sharp golden point, and the other with a blunt tip of lead. A person wounded by the golden arrow is filled with uncontrollable desire, but the one struck by the lead feels aversion and desires only to flee. The use of these arrows is described by the Latin poet Ovid in the first book of his Metamorphoses. When Apollo taunts Cupid as the lesser archer, Cupid shoots him with the golden arrow, but strikes the object of his desire, the nymph Daphne, with the lead. Trapped by Apollo's unwanted advances, Daphne prays to her father, the river god Peneus, who turns her into a laurel, the tree sacred to Apollo. It is the first of several unsuccessful or tragic love affairs for Apollo. This theme is somewhat mirrored in the story of Echo and Narcissus, as the goddess Juno forces the nymph Echo's love upon Narcissus, who is cursed by the goddess Nemesis to be self absorbed and unresponsive to her desires. \nA variation is found in The Kingis Quair, a 15th-century poem attributed to James I of Scotland, in which Cupid has three arrows: gold, for a gentle \"smiting\" that is easily cured; the more compelling silver; and steel, for a love-wound that never heals.\nIn classical mythology, Cupid /ˈkjuːpɪd/ (Latin: Cupīdō [kʊˈpiːdoː], meaning \"passionate desire\") is the god of desire, erotic love, attraction and affection. He is often portrayed as the son of the love goddess Venus and the god of war Mars. He is also known as Amor /ˈæmər/ (Latin: Amor, \"love\"). His Greek counterpart is Eros. Although Eros is generally portrayed as a slender winged youth in Classical Greek art, during the Hellenistic period, he was increasingly portrayed as a chubby boy. During this time, his iconography acquired the bow and arrow that represent his source of power: a person, or even a deity, who is shot by Cupid's arrow is filled with uncontrollable desire. In myths, Cupid is a minor character who serves mostly to set the plot in motion. He is a main character only in the tale of Cupid and Psyche, when wounded by his own weapons, he experiences the ordeal of love. Although other extended stories are not told about him, his tradition is rich in poetic themes and visual scenarios, such as \"Love conquers all\" and the retaliatory punishment or torture of Cupid.\nIn art, Cupid often appears in multiples as the Amores /əˈmɔːriːz/ (in the later terminology of art history, Italian amorini), the equivalent of the Greek Erotes. Cupids are a frequent motif of both Roman art and later Western art of the classical tradition. In the 15th century, the iconography of Cupid starts to become indistinguishable from the putto.\nCupid continued to be a popular figure in the Middle Ages, when under Christian influence he often had a dual nature as Heavenly and Earthly love. In the Renaissance, a renewed interest in classical philosophy endowed him with complex allegorical meanings. In contemporary popular culture, Cupid is shown drawing his bow to inspire romantic love, often as an icon of Valentine's Day. Cupid's powers are similar, though not identical, to Kamadeva, the Hindu god of human love.",
  "synonyms": "arrow,dart,flechette,gypsobelum,stylet,harpoon,needle;arrows,darts,flechettes,gypsobela,stylets,harpoons,needles",
  "number_sentences": 10
}
